package com.example.mars.demo;

public class TestMonkeys {
    public static boolean aa=false;

    public static void main(String[] args) {
        // doTest();
        doTest3();

    }


    /**
     * 海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子凭据分为五份，多了一个，这只猴子把多的一个扔入海中，拿走了一份。
     * 第二只猴子把剩下的桃子又平均分成五份，又多了一个，它同样把多的一个扔入海中，拿走了一份，第三、第四、第五只猴子都是这样做的，
     * 问海滩上原来最少有多少个桃子？
     * 第五只猴子拿走了x,拿走之前是5x+1个，
     * 第四只猴子拿走前是5x+1个是4份，需要加1份再加1个(5x+1)*4/5+1
     * 第三只猴子拿走前是((5x+1)*4/5+1)*4/5+1
     * 第二只猴子拿走前是（((5x+1)*4/5+1)*4/5+1）*4/5+1
     * 第一只猴子拿走前是（（((5x+1)*4/5+1)*4/5+1）*4/5+1）*4/5+1
     * 原来有x只桃子
     * 第一只猴子拿走了(x-1)/5
     * 第二只猴子拿走了((x-1)/5-1)/5
     * 第三只猴子拿走了(((x-1)/5-1)/5-1)/5
     * 第四只猴子拿走了((((x-1)/5-1)/5-1)/5-1)/5
     * 第五只猴子拿走了(((((x-1)/5-1)/5-1)/5-1)/5-1)/5
     */
    // public static void doTest() {
    //     for (int x = 500; x<10000 ; x++) {
    //         if ((x-1)%5==0&&((x-1)/5-1)%5==0&&(((x-1)/5-1)/5-1)%5==0&&((((x-1)/5-1)/5-1)/5-1)%5==0&&(((((x-1)/5-1)/5-1)/5-1)/5-1)%5==0) {
    //             System.out.println(x);
    //         }
    //     }
    // }

    public static int doTest2(int a,int b) {
        if ((a-1)%5==0&&a>1) {
            b++;
            if (b == 5) {
                return 111;
            }
            return doTest2((a-1)/5*4,b);
        }
        return 0;
    }

    public static void doTest3() {
        for (int x = 780; x<10000 ; x++) {
            int a=doTest2(x,0);
            if (a == 111) {
                System.out.println(x);
            }
        }
    }

}
